---
type: MacroModule
namespace: Autodesk.Revit.DB.Macros
version: 2024
members: 15
tags: [revit-api, class]
---

# MacroModule

`Autodesk.Revit.DB.Macros.MacroModule` · Revit 2024 · 15 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddMacro | 2014 | `public Macro AddMacro ( string name , string description , string code )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetBasicIEnumerator | — | `internal virtual IEnumerator GetBasicIEnumerator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator < Macro > GetEnumerator ()` |
| Method | GetMacro | 2014 | `public Macro GetMacro ( string name )` |
| Method | GetMacroModuleIterator | 2014 | `public MacroModuleIterator GetMacroModuleIterator ()` |
| Method | RemoveMacro | 2014 | `public void RemoveMacro ( Macro macro )` |
| Property | Description | 2014 | `public string Description { get ; set ; }` |
| Property | Environment | 2014 | `public MacroEnvironment Environment { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | MacroLanguageType | 2014 | `public MacroLanguageType MacroLanguageType { get ; }` |
| Property | MacroLevel | 2014 | `public MacroLevel MacroLevel { get ; }` |
| Property | MacroManager | 2014 | `public MacroManager MacroManager { get ; }` |
| Property | ModuleStatus | 2014 | `public ModuleStatus ModuleStatus { get ; }` |
| Property | Name | 2014 | `public string Name { get ; }` |